# Conductor Size Id Property

Source: https://www.revitapidocs.com/2026/abd94ad0-4db5-2d73-8d43-799f56c154b2.htm

---

| Conductor Size Id Property |
| --- |

The Conductor Size id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId Id { get; }
```

```
Public ReadOnly Property Id As ElementId
	Get
```

```
public:
property ElementId^ Id {
	ElementId^ get ();
}
```

```
member Id : ElementId with get
```

#### Property Value

ElementId See Also

#### Reference

ConductorSize Class Autodesk.Revit.DB.Electrical Namespace